<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"eb7f1ab2dc4d77ba21f6ac0beb8988f0abba28c87ba65133c5fe78267d35eb3b","plan_job_ref":"Job Terraform plan #20 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8124963599","plan_out_hash":"ea9b5e09d15a4f8f93ba2d1b72c16d5a91e3835521d6ceca119e5ede77330220","plan_hash":"69644ef248999f69a71d718dc92bd3e40809584a1d51c7fd10bd4e3a4e1b4661","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # yandex_function_iam_binding.yandex-reverse-image-search-iam will be created
+   resource "yandex_function_iam_binding" "yandex-reverse-image-search-iam" {
+       function_id = "********************"
+       id          = (known after apply)
+       members     = (known after apply)
+       role        = "functions.functionInvoker"
    }

  # yandex_iam_service_account.sa-yandex-reverse-image-search will be created
+   resource "yandex_iam_service_account" "sa-yandex-reverse-image-search" {
+       created_at  = (known after apply)
+       description = "Service account to invoke yandex-reverse-image-search"
+       folder_id   = (known after apply)
+       id          = (known after apply)
+       name        = "yandex-reverse-image-search-sa"
    }

  # yandex_iam_service_account_api_key.sa-yandex-reverse-image-search-api-key will be created
+   resource "yandex_iam_service_account_api_key" "sa-yandex-reverse-image-search-api-key" {
+       created_at           = (known after apply)
+       encrypted_secret_key = (known after apply)
+       id                   = (known after apply)
+       key_fingerprint      = (known after apply)
+       secret_key           = (sensitive value)
+       service_account_id   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform apply #9](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8124970205)